app/controllers/api/v1/evaluation_controller.rb

SELECT  `evaluations`.* FROM `evaluations` WHERE `evaluations`.`target_profile_id` = 9 LIMIT 1
---
  def getEvaluationsByProfile
      render json: Evaluation.where(target_profile_id: params[:target_profile_id])

SELECT  `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 1 LIMIT 1
INSERT INTO `evaluations` (`rate`, `comment`, `target_profile_id`, `source_profile_id`, `created_at`, `updated_at`) VALUES (1, 'No me gusta nada', 9, 9, '2015-10-01 10:19:45', '2015-10-01 10:19:45')
---
  def create
    @evaluation = Evaluation.new(evaluation_params)
    @evaluation.source_profile_id = Profile.find_by(user_id: doorkeeper_token.resource_owner_id).id
    respond_to do |format|
      if @evaluation.save