app/controllers/api/v1/profile_controller.rb

  def myProfile
    #render json: User.find(doorkeeper_token.resource_owner_id).as_json
    render json: Profile.where(user_id: doorkeeper_token.resource_owner_id).as_json
---
SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 1

  def getProfileById
      render json: Profile.find_by_id(params[:id])
---
SELECT  `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 8 LIMIT 1

  def create_update
    @profile = Profile.where(user_id: doorkeeper_token.resource_owner_id).first_or_initialize
    @profile.update_attributes(profile_params)
---
SELECT  `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 1  ORDER BY `profiles`.`id` ASC LIMIT 1
UPDATE `profiles` SET `name` = 'prueba', `age` = 27, `updated_at` = '2015-09-30 20:03:27' WHERE `profiles`.`id` = 8